Fantastic-5---Project-6/DreamBox/app/controllers/dreams_controller.rb

  def index
    @dreams = current_user.dreams.all.order("created_at DESC").search(params[:search])
---
SELECT "dreams".* FROM "dreams" WHERE "dreams"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @dream = current_user.dreams.build(dream_params)

    respond_to do |format|
      if @dream.save
---
INSERT INTO "dreams" ("description", "start_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "<p>wocao</p>\r\n"], ["start_time", "2016-04-19 04:30:00.000000"], ["user_id", 1], ["created_at", "2016-04-19 04:33:08.125031"], ["updated_at", "2016-04-19 04:33:08.125031"]]

    def set_dream
      @dream = Dream.find(params[:id])
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = ? LIMIT 1  [["id", 1]]