Fantastic-5---Project-6/DreamBox/app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "description", "category", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "123"], ["description", "<p>23</p>\r\n"], ["category", "12"], ["user_id", 1], ["created_at", "2016-04-19 04:26:38.691338"], ["updated_at", "2016-04-19 04:26:38.691338"]]